In [1]:
# Para trabajar con ficheros
# -----------------------------------------------------------------------
import os


# Para trabajar con los DataFrames
# -----------------------------------------------------------------------
import pandas as pd

# Para poner barras progreso
# -----------------------------------------------------------------------
from tqdm import tqdm

# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

from datetime import datetime


# Ignorar warings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [2]:
df_economico=pd.read_csv("datos/datos_agregados/economico_agr.csv", index_col= "Unnamed: 0")
df_poblacional=pd.read_csv("datos/datos_agregados/poblacional_agr.csv", index_col= "Unnamed: 0")
df_todo_demanda=pd.read_csv("datos/datos_agregados/demanda_agr.csv", index_col= "Unnamed: 0")
df_todo_oferta=pd.read_csv("datos/datos_agregados/oferta_agr.csv", index_col= "Unnamed: 0")

In [3]:
df_todo_oferta.head(3)

       value  percentage        type  cod_ccaa       ccaa  month  year
0  25288.605    0.029517  Hidráulica         4  Andalucía      1  2019
1  33933.350    0.030779  Hidráulica         4  Andalucía      2  2019
2  35913.000    0.029645  Hidráulica         4  Andalucía      3  2019

In [4]:
df_todo_oferta.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2909 entries, 0 to 2908
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   value       2909 non-null   float64
 1   percentage  2909 non-null   float64
 2   type        2909 non-null   object
 3   cod_ccaa    2909 non-null   int64
 4   ccaa        2909 non-null   object
 5   month       2909 non-null   int64
 6   year        2909 non-null   int64
dtypes: float64(2), int64(3), object(2)
memory usage: 181.8+ KB

In [5]:
df_todo_demanda.head(3)

         value  percentage  cod_ccaa       ccaa  month  year
0  3668893.328           1         4  Andalucía      1  2019
1  3152278.091           1         4  Andalucía      2  2019
2  3216356.360           1         4  Andalucía      3  2019

In [6]:
df_todo_demanda.info()

<class 'pandas.core.frame.DataFrame'>
Index: 684 entries, 0 to 683
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   value       684 non-null    float64
 1   percentage  684 non-null    int64
 2   cod_ccaa    684 non-null    int64
 3   ccaa        684 non-null    object
 4   month       684 non-null    int64
 5   year        684 non-null    int64
dtypes: float64(1), int64(4), object(1)
memory usage: 37.4+ KB

In [7]:
df_poblacional.head(3)

,Edad (3 grupos de edad),Españoles/Extranjeros,Sexo,Año,Total,cod_prov,provincias
0,0-15 años,Españoles,Hombres,2021,27304.0,2,Albacete
1,0-15 años,Españoles,Hombres,2020,27979.0,2,Albacete
2,0-15 años,Españoles,Hombres,2019,28513.0,2,Albacete

In [8]:
df_poblacional.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1872 entries, 0 to 1871
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Edad (3 grupos de edad)  1872 non-null   object
 1   Españoles/Extranjeros    1872 non-null   object
 2   Sexo                     1872 non-null   object
 3   Año                      1872 non-null   int64
 4   Total                    1872 non-null   float64
 5   cod_prov                 1872 non-null   int64
 6   provincias               1872 non-null   object
dtypes: float64(1), int64(2), object(4)
memory usage: 117.0+ KB

In [9]:
df_economico.head(3)

,periodo,Total,cod_prov,provincias,cod_actividad,ramas de actividad
0,2021,884324,2,Albacete,1,"Agricultura, ganadería, silvicultura y pesca"
1,2020,768976,2,Albacete,1,"Agricultura, ganadería, silvicultura y pesca"
2,2019,791464,2,Albacete,1,"Agricultura, ganadería, silvicultura y pesca"

In [10]:
df_economico.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1092 entries, 0 to 1091
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   periodo             1092 non-null   int64
 1   Total               1092 non-null   int64
 2   cod_prov            1092 non-null   int64
 3   provincias          1092 non-null   object
 4   cod_actividad       1092 non-null   int64
 5   ramas de actividad  1092 non-null   object
dtypes: int64(4), object(2)
memory usage: 59.7+ KB

EMPIEZO CREANDO LAS TABLAS SIN FK

In [11]:
def crear_id(df_anti,nombre_col_antigua,nombre_col_nueva,nombre_col_id_nuevo):
    anio= pd.DataFrame()
    anio[nombre_col_nueva]=df_anti[nombre_col_antigua].unique()
    anio.index=anio.index+1
    df_nuevo=anio.reset_index().rename(columns={'index': nombre_col_id_nuevo})
    return df_nuevo

In [12]:
df_anio=crear_id(df_economico,"periodo","anio","id_anio")

In [13]:
df_anio

   id_anio  anio
0        1  2021
1        2  2020
2        3  2019

In [14]:
df_actividad=pd.DataFrame()
df_actividad["actividad"] =df_economico["ramas de actividad"].unique()
df_actividad["id_actividad"]= df_economico["cod_actividad"].unique()

In [15]:
df_actividad

                                           actividad  id_actividad
0       Agricultura, ganadería, silvicultura y pesca             1
1   Industrias extractivas, industria manufacture...             2
2           - De las cuales: Industria manufacturera             3
3                                       Construcción             7
4   Comercio al por mayor y al por menor, reparac...             4
5   Actividades financieras y de seguros, activid...             5
6   Administración pública y defensa, seguridad s...             6

In [16]:
df_nacionalidad=crear_id(df_poblacional,"Españoles/Extranjeros","nacionalidad","id_nacionalidad")

In [17]:
df_nacionalidad

   id_nacionalidad nacionalidad
0                1    Españoles
1                2  Extranjeros

In [18]:
df_sexo=crear_id(df_poblacional,"Sexo","sexo","id_sexo")

In [19]:
df_sexo

   id_sexo     sexo
0        1  Hombres
1        2  Mujeres

In [20]:
df_edad=crear_id(df_poblacional,"Edad (3 grupos de edad)","rango_edad","id_rango_edad")

In [21]:
df_edad

   id_rango_edad  rango_edad
0              1   0-15 años
1              2  16-64 años
2              3    65 y más

In [22]:
df_type=crear_id(df_todo_oferta,"type","type","id_type")

In [23]:
df_type

   id_type                 type
0        1           Hidráulica
1        2               Eólica
2        3   Solar fotovoltaica
3        4        Solar térmica
4        5     Otras renovables
5        6          Hidroeólica
6        7  Residuos renovables

In [24]:
df_CCAA=pd.DataFrame()
df_CCAA["ccaa"] =df_todo_demanda["ccaa"].unique()
df_CCAA["id_ccaa"]= df_todo_demanda["cod_ccaa"].unique()

In [25]:
df_CCAA.head(3)

        ccaa  id_ccaa
0  Andalucía        4
1     Aragón        5
2   Canarias     8742

In [26]:
df_provincia=pd.DataFrame()
df_provincia["provincia"] =df_economico["provincias"].unique()
df_provincia["id_provincia"]= df_economico["cod_prov"].unique()

In [27]:
df_provincia.head(3)

          provincia  id_provincia
0          Albacete             2
1  Alicante/Alacant             3
2           Almería             4

EMPEZAMOS CON LAS TABLAS HEAVIES

DEMANDA (quitamos ccaa, cambiamos nombre de cod_ccaa a id_ccaa, mapeamos y metemos el id_anio)

In [28]:
df_todo_demanda.head()

         value  percentage  cod_ccaa       ccaa  month  year
0  3668893.328           1         4  Andalucía      1  2019
1  3152278.091           1         4  Andalucía      2  2019
2  3216356.360           1         4  Andalucía      3  2019
3  3029639.973           1         4  Andalucía      4  2019
4  3154123.467           1         4  Andalucía      5  2019

In [29]:
df_todo_demanda=df_todo_demanda.rename(columns={'cod_ccaa': "id_ccaa"})
df_todo_demanda.drop(columns="ccaa", inplace=True)

In [30]:
df_todo_demanda.head()

         value  percentage  id_ccaa  month  year
0  3668893.328           1        4      1  2019
1  3152278.091           1        4      2  2019
2  3216356.360           1        4      3  2019
3  3029639.973           1        4      4  2019
4  3154123.467           1        4      5  2019

In [31]:

dicc_anio = df_anio.set_index('anio')['id_anio'].to_dict()
dicc_anio

{2021: 1, 2020: 2, 2019: 3}

In [32]:

df_todo_demanda['id_anio'] = df_todo_demanda['year'].map(dicc_anio)

In [33]:
df_todo_demanda.drop(columns="year", inplace=True)

In [34]:
df_todo_demanda.head()

         value  percentage  id_ccaa  month  id_anio
0  3668893.328           1        4      1        3
1  3152278.091           1        4      2        3
2  3216356.360           1        4      3        3
3  3029639.973           1        4      4        3
4  3154123.467           1        4      5        3

OFERTA

In [35]:
df_todo_oferta.head()

       value  percentage        type  cod_ccaa       ccaa  month  year
0  25288.605    0.029517  Hidráulica         4  Andalucía      1  2019
1  33933.350    0.030779  Hidráulica         4  Andalucía      2  2019
2  35913.000    0.029645  Hidráulica         4  Andalucía      3  2019
3  44050.848    0.041340  Hidráulica         4  Andalucía      4  2019
4  88535.452    0.068497  Hidráulica         4  Andalucía      5  2019

In [36]:
df_todo_oferta=df_todo_oferta.rename(columns={'cod_ccaa': "id_ccaa"})
df_todo_oferta.drop(columns="ccaa", inplace=True)

In [37]:
df_todo_oferta.head()

       value  percentage        type  id_ccaa  month  year
0  25288.605    0.029517  Hidráulica        4      1  2019
1  33933.350    0.030779  Hidráulica        4      2  2019
2  35913.000    0.029645  Hidráulica        4      3  2019
3  44050.848    0.041340  Hidráulica        4      4  2019
4  88535.452    0.068497  Hidráulica        4      5  2019

In [38]:

df_todo_oferta['id_anio'] = df_todo_oferta['year'].map(dicc_anio)

In [39]:
dicc_type = df_type.set_index('type')['id_type'].to_dict()
dicc_type

{'Hidráulica': 1,
 'Eólica': 2,
 'Solar fotovoltaica': 3,
 'Solar térmica': 4,
 'Otras renovables': 5,
 'Hidroeólica': 6,
 'Residuos renovables': 7}

In [40]:
df_todo_oferta['id_type'] = df_todo_oferta['type'].map(dicc_type)

In [41]:
df_todo_oferta.drop(columns="year", inplace=True)
df_todo_oferta.drop(columns="type", inplace=True)

In [42]:
df_todo_oferta.head()

       value  percentage  id_ccaa  month  id_anio  id_type
0  25288.605    0.029517        4      1        3        1
1  33933.350    0.030779        4      2        3        1
2  35913.000    0.029645        4      3        3        1
3  44050.848    0.041340        4      4        3        1
4  88535.452    0.068497        4      5        3        1

ECONOMICO

In [43]:
df_economico.head()

,periodo,Total,cod_prov,provincias,cod_actividad,ramas de actividad
0,2021,884324,2,Albacete,1,"Agricultura, ganadería, silvicultura y pesca"
1,2020,768976,2,Albacete,1,"Agricultura, ganadería, silvicultura y pesca"
2,2019,791464,2,Albacete,1,"Agricultura, ganadería, silvicultura y pesca"
3,2021,1397006,2,Albacete,2,"Industrias extractivas, industria manufacture..."
4,2020,1194438,2,Albacete,2,"Industrias extractivas, industria manufacture..."

In [44]:
df_economico=df_economico.rename(columns={'cod_actividad': "id_actividad"})
df_economico=df_economico.rename(columns={'cod_prov': "id_provincia"})
df_economico.drop(columns="ramas de actividad", inplace=True)
df_economico.drop(columns="provincias", inplace=True)

In [45]:
df_economico.head()

   periodo    Total  id_provincia  id_actividad
0     2021   884324             2             1
1     2020   768976             2             1
2     2019   791464             2             1
3     2021  1397006             2             2
4     2020  1194438             2             2

In [47]:

df_economico['id_anio'] = df_economico['periodo'].map(dicc_anio)

In [48]:
df_economico.drop(columns="periodo", inplace=True)

In [49]:
df_economico.head()

     Total  id_provincia  id_actividad  id_anio
0   884324             2             1        1
1   768976             2             1        2
2   791464             2             1        3
3  1397006             2             2        1
4  1194438             2             2        2

POBLACIONAL

In [50]:
df_poblacional.head()

,Edad (3 grupos de edad),Españoles/Extranjeros,Sexo,Año,Total,cod_prov,provincias
0,0-15 años,Españoles,Hombres,2021,27304.0,2,Albacete
1,0-15 años,Españoles,Hombres,2020,27979.0,2,Albacete
2,0-15 años,Españoles,Hombres,2019,28513.0,2,Albacete
3,0-15 años,Españoles,Mujeres,2021,25547.0,2,Albacete
4,0-15 años,Españoles,Mujeres,2020,25953.0,2,Albacete

In [51]:
df_poblacional=df_poblacional.rename(columns={'cod_prov': "id_provincia"})
df_poblacional.drop(columns="provincias", inplace=True)

In [52]:
df_poblacional.head()

,Edad (3 grupos de edad),Españoles/Extranjeros,Sexo,Año,Total,id_provincia
0,0-15 años,Españoles,Hombres,2021,27304.0,2
1,0-15 años,Españoles,Hombres,2020,27979.0,2
2,0-15 años,Españoles,Hombres,2019,28513.0,2
3,0-15 años,Españoles,Mujeres,2021,25547.0,2
4,0-15 años,Españoles,Mujeres,2020,25953.0,2

In [53]:
dicc_edad = df_edad.set_index('rango_edad')['id_rango_edad'].to_dict()
dicc_nac = df_nacionalidad.set_index('nacionalidad')['id_nacionalidad'].to_dict()
dicc_sexo = df_sexo.set_index('sexo')['id_sexo'].to_dict()

In [54]:
df_poblacional['id_rango_edad'] = df_poblacional['Edad (3 grupos de edad)'].map(dicc_edad)
df_poblacional['id_nacionalidad'] = df_poblacional['Españoles/Extranjeros'].map(dicc_nac)
df_poblacional['id_sexo'] = df_poblacional['Sexo'].map(dicc_sexo)
df_poblacional['id_anio'] = df_poblacional['Año'].map(dicc_anio)

In [55]:
df_poblacional.drop(columns="Edad (3 grupos de edad)", inplace=True)
df_poblacional.drop(columns="Españoles/Extranjeros", inplace=True)
df_poblacional.drop(columns="Sexo", inplace=True)
df_poblacional.drop(columns="Año", inplace=True)

In [56]:
df_poblacional.head()

     Total  id_provincia  id_rango_edad  id_nacionalidad  id_sexo  id_anio
0  27304.0             2              1                1        1        1
1  27979.0             2              1                1        1        2
2  28513.0             2              1                1        1        3
3  25547.0             2              1                1        2        1
4  25953.0             2              1                1        2        2